app/Controllers/Admin/Category.php

UPDATE `category` SET `name` = 'Pharmaceutical Sciences - SS', `type` = 'Science Scholar Awards', `status` = 'Active', `updated_date` = '2022-09-09 00:38:57', `updated_id` = '1'
WHERE `category`.`id` IN ('13')
---
                        $session->setFlashdata('msg', 'Category Updated Successfully!');
                        $ins_data['updated_date']  =  date("Y-m-d H:i:s");
                        $ins_data['updated_id']    =  $userdata['login_id'];
                        $categoryModel->update(array("id" => $id),$ins_data);