app/Controllers/Nomination.php

INSERT INTO `users` (`firstname`, `email`, `phone`, `address`, `dob`, `role`, `created_date`, `created_id`) VALUES ('Test', 'punitha@izaaptech.in', '9786543217', 'Test', '2022/08/25', 2, '2022-08-26 01:07:58', 1)
---
                            $this->session->setFlashdata('msg', 'Submitted Successfully!');
                            $ins_data['created_date']  =  date("Y-m-d H:i:s");
                            $ins_data['created_id']    =  1;
                            $this->userModel->save($ins_data);

INSERT INTO `nominee_details` (`category_id`, `citizenship`, `nomination_type`, `residence_address`, `nominator_name`, `nominator_email`, `nominator_phone`, `nominator_address`, `nominee_id`, `passport_filename`, `justification_letter_filename`, `nominator_photo`) VALUES ('Medical Sciences-Basic Research', '1', 'spsfn', 'Test', 'Test', 'bh@gmail.com', '9786543217', 'Test', 12, '32007859_09-Aug-2022.pdf', 'Foreclosure Statement.pdf', 'robots.jpg')
---
                            $nominee_details_data['justification_letter_filename']      = $justification_letter->getClientName();
                            $nominee_details_data['nominator_photo']                    = $nominator_photo->getClientName();

                            $this->nominationModel->save($nominee_details_data);