app/Models/AwardsModel.php

SELECT `category`.`name` as `category_name`, SUM(ratings.rating) as average_rating, `users`.`firstname`, `users`.`dob`, `users`.`id`, GROUP_CONCAT(ratings.jury_id SEPARATOR ", ") as jury
FROM `category`
JOIN `nominee_details` ON `nominee_details`.`category_id` = `category`.`id`
JOIN `users` ON `users`.`id` = `nominee_details`.`nominee_id` AND `users`.`role`="2" AND `users`.`status`="Approved"
JOIN `ratings` ON `ratings`.`nominee_id` = `users`.`id`
WHERE `nominee_details`.`category_id` = '4'
AND YEAR(nominee_details.created_date) = '2022'
AND `ratings`.`is_rate_submitted` = '1'
GROUP BY `ratings`.`nominee_id`
ORDER BY `average_rating` DESC
---
    public function getLists($category='',$year='')
    {
        $builder = $this->table('category');
        $builder->select('category.name as category_name,SUM(ratings.rating) as average_rating,users.firstname,users.dob,users.id,GROUP_CONCAT(ratings.jury_id SEPARATOR ", ") as jury,nominee_details.nominator_photo');
        $builder->join('nominee_details', 'nominee_details.category_id = category.id');
        $builder->join('users', 'users.id = nominee_details.nominee_id AND users.role="2" AND users.status="Approved"');
        $builder->join('ratings', 'ratings.nominee_id = users.id');
        if(!empty($category))
          $builder->where("nominee_details.category_id",$category);
        if(!empty($year))
            $builder->where("YEAR(nominee_details.created_date)",$year);

        $builder->where("ratings.is_rate_submitted","1");
        $builder->orderBy("average_rating","DESC");
        $builder->groupBy("ratings.nominee_id");
        return $query = $builder->get();