app/Models/CategoryModel.php

SELECT *
FROM `category`
SELECT *
FROM `category`
WHERE `id` = '4'
---
    public function getListsOfCategories($id='')
    {
        if(empty($id))
         return $this->findAll();
        else
          return $this->getWhere(array('id' => $id));