app/Models/JuryModel.php

    public function getListsOfNominees($id='')
    {
        $builder = $this->table('jury_nominee');
        $builder->select('jury_nominee.created_date,users.firstname,users.lastname,users.phone,users.email,users.address,users.id');
        $builder->join('users', 'users.id = jury_nominee.nominee_id AND users.role="2"');
        $builder->where("jury_nominee.jury_id",$id);
        return $query = $builder->get();
---
SELECT `jury_nominee`.`created_date`, `users`.`firstname`, `users`.`lastname`, `users`.`phone`, `users`.`email`, `users`.`address`, `users`.`id`
FROM `jury_nominee`
JOIN `users` ON `users`.`id` = `jury_nominee`.`nominee_id` AND `users`.`role`="2"
WHERE `jury_nominee`.`jury_id` = '2'