app/Models/NomineeModel.php

    public function getListsOfNominees($id='')
    {
        if(empty($id)){
        // return $this->getWhere(array("role" => '2'));
            $builder = $this->table('users');
            $builder->select('users.*,jury_nominee.jury_id');
            $builder->join('jury_nominee', 'jury_nominee.nominee_id = users.id','left');
            $builder->where("users.role",'2');
            return $query = $builder->get();
---
SELECT `users`.*, `jury_nominee`.`jury_id`
FROM `users`
LEFT JOIN `jury_nominee` ON `jury_nominee`.`nominee_id` = `users`.`id`
WHERE `users`.`role` = '2'

    public function getJuryName($id='')
    {
        $builder = $this->table('users');
        $builder->select('users.firstname,users.lastname');
        $builder->join('jury_nominee', 'jury_nominee.jury_id = users.id AND users.role="1"');
        $builder->where("jury_nominee.jury_id",$id);
        return $query = $builder->get();
---
SELECT `users`.`firstname`, `users`.`lastname`
FROM `users`
JOIN `jury_nominee` ON `jury_nominee`.`jury_id` = `users`.`id` AND `users`.`role`="1"
WHERE `jury_nominee`.`jury_id` IS NULL