app/Models/NominationTypesModel.php

SELECT *
FROM `nominations`
WHERE `id` = '2'
---
    public function getListsOfNominations($id='')
    {
        if(empty($id)){
            $builder = $this->table('nominations');
            $builder->select('nominations.*');
            $builder->orderBy('status', '1');
            $builder->orderBy('title', 'ASC');
            return $query = $builder->get();
        }
        else
            return $this->getWhere(array('id' => $id));

SELECT *
FROM `nominations`
WHERE `category_id` = '5'
---
    public function getCategoryWiseNominations()
    {
        $builder = $this->table('nominations');
        $builder->select('nominations.*,category.type');
        $builder->join('category','category.id = nominations.category_id');
        return $query = $builder->get();