app/Models/RatingModel.php

SELECT *
FROM `ratings`
WHERE `jury_id` = '1'
AND `nominee_id` = '4'
---
    public function getRatingData($jury_id='',$nominee_id='')
    {
        return $this->getWhere(array('jury_id' => $jury_id,'nominee_id' =>$nominee_id));

SELECT `ratings`.*, `users`.`firstname`
FROM `ratings`
JOIN `users` ON `users`.`id` = `ratings`.`jury_id` AND `users`.`role`=1
WHERE `ratings`.`nominee_id` = '4'
---
    public function getRatingByJury($nominee_id)
    {
        $builder = $this->table('ratings');
        $builder->select('ratings.*,users.firstname');
        $builder->join('users','users.id = ratings.jury_id AND users.role=1');
        $builder->where("ratings.nominee_id",$nominee_id);
        return $query = $builder->get();