app/Models/RoleModel.php

    public function getListsOfRoles()
    {
        return $this->findAll();
---
SELECT *
FROM `roles`