app/Models/UserModel.php

    public function Login($username, $password) {
        $result = $this->db
                        ->table($this->table)
                        ->where(array("username" => $username, "password" => $password))
                        ->get()
                        ->getRow();
        if($result) {
            $data = [
                'login_id'          => $result->id,
                'login_name'        => $result->firstname,
                'login_email'       => $result->email,
                'isLoggedIn'        => TRUE,
                'role'              => $result->role,
                'id'  => $result->id
            ];
---
SELECT *
FROM `users`
WHERE `username` = 'harthik'
AND `password` = '389a4ce763720bc8222d24830ba134d5'
SELECT *
FROM `users`

    public function fLogin($username, $password) {
        $result = $this->db
                        ->table($this->table)
                        ->where(array("email" => $username, "password" => $password))
                        ->get()
                        ->getRow();
        if($result) {
            $data = [
                'id'          => $result->id,
                'name'        => $result->firstname,
                'email'       => $result->email,
                'isLoggedIn'  => TRUE,
                'role'        => $result->role,
                'isNominee'   => 'yes'
            ];
---
SELECT *
FROM `users`

    public function getListsOfUsers($id='')
    {
        if(empty($id))
         return $this->findAll();
        else
          return $this->getWhere(array('id' => $id));
---
SELECT *
FROM `users`
WHERE `id` = '4'

    public function getJuryRateData($jury_id = '',$nominee_id = '')
    {
        $builder = $this->table('users');
        $builder->select('users.*,ratings.rating');
        $builder->join('ratings','ratings.jury_id = users.id AND ratings.nominee_id='.$nominee_id);
        $builder->where("users.role",'1');
        $builder->where("users.id",$jury_id);
        return $query = $builder->get();
---
SELECT `users`.*, `ratings`.`rating`
FROM `users`
JOIN `ratings` ON `ratings`.`jury_id` = `users`.`id` AND `ratings`.`nominee_id`=6
WHERE `users`.`role` = '1'
AND `users`.`id` = '2'